{
    "version": "https://jsonfeed.org/version/1",
    "title": "thanhngoc.me",
    "description": "",
    "home_page_url": "https://thanhngoc.me",
    "feed_url": "https://thanhngoc.me/feed.json",
    "user_comment": "",
    "author": {
        "name": "Thanh Ngoc"
    },
    "items": [
        {
            "id": "https://thanhngoc.me/jackfruits-2/",
            "url": "https://thanhngoc.me/jackfruits-2/",
            "title": "JACKFRUITS",
            "summary": "I woke up with a terrible headache this morning. I reached out for my notebook, trying to write down the dreams I had last night, but the details were all vague and fragmentary. The events were there but they all mixed up and, no matter&hellip;",
            "content_html": "<p class=\"p2 align-left\">I woke up with a terrible headache this morning. I reached out for my notebook, trying to write down the dreams I had last night, but the details were all vague and fragmentary. The events were there but they all mixed up and, no matter how hard I forced my conscousness, I couldn’t conjure up the flow of the story. I was sure my Australian ex-boyfriend was there. So were my first crush from primary school and my families (my parents and, surprisingly, my uncles).</p>\n<p class=\"p2\">At one scene, my ex-boyfriend was taking me on a road trip on a Blade Honda scooter that looked like a swiftlet bird. No, actually, it looked more like a swallow as I remembered its trailing forked tail and the red-orange blades. We caught sight of the traffic policemen ahead pulling vehicles over. I asked him to move to the next lane to avoid being caught but he voluntarily stopped at the checkpoint. An officer was tasked with handling his case, giving he was the only could utter some English phrases, and he walked us into a cabin off the road.</p>\n<p>- \"Show me your bike registration!\" He commanded.</p>\n<p class=\"p2\">My ex confidently pulled out an A4-sized certificate written Daniel de Filippo on it. <em>\"Shouldn't it be his name instead of his good friend's</em>?\" I thought to myself but tried to contain my confusion. </p>\n<p>- “Now your driving license!” The police added. </p>\n<p class=\"p2\">As if he’d been waiting for it to be asked, he took out a plastic card the size of a lottery ticket. The officer examined it and let out a smile.</p>\n<p>- “Good good. You are handsome. I’m sure you’ll be a good driver too.” he commented with an effervescent laugh.</p>\n<p class=\"p2\">My ex laughed along.</p>\n<p>- “Photo? You, me?” The officer asked with his broken English and pointed with his index at him then my ex. </p>\n<p>- “Ok Ok”. My ex said excitedly while pulling the officer’s shoulder closer to his and I took a photo of them.</p>\n<p class=\"p2\">We said goodbye and were back on the road.</p>\n<p>- “We don’t give a damn about these police from now on. We have the photo as our get-out-of-checkpoint-free card.” My ex mischievously declared and I quietly agreed. </p>\n<p class=\"p2\">Fast forward to the next scene and I found myself at a wooden sack. (I think my ex-boyfriend dropped me off and disappeared). There were several of them nestled on a hill. It must have been a residency or a guesthouse complex. The sack was basic with a rectangular table, four chairs set on one side of it while the other side pressed against a wall below the only doorless window, and a shrine hung from the ceiling by a chain. The only source of light in the house was from the tiny red LED no bigger than a ghost pepper placed on the head of the Lady Buddha statue on the shrine. She looked down from the shrine, in the bloody aura, with a gentle smile. </p>\n<p class=\"p2\">I suddenly remembered why I was there, in the bleak and desolate living room. I was waiting for someone, someone going to murder me as the letter had warned.</p>\n<p class=\"p2\">But what letter? When had it been sent and by whom? I couldn’t wrap my head around it. I tried to make up something when I was awake and conscious to reach that gap but nothing was coherent enough. One thing for sure, though, was that someone had sent me a letter foretelling me about me death.</p>\n<p class=\"p2\">When I was patiently waiting, which was not at all my nature, my childhood crush, who stayed in another sack behind mine, stuck his head through the window and handed me a bad of air-fried jackfruit.</p>\n<p>- “For you to kill time while waiting for your death.” He said and smiled childishly like the old days.</p>\n<p>I took no offense to what he said. In contrast, I was pleased with his thoughtfulness. Think of it, his name was literally translated into the Sky or the Heaven. <em>Was Heaven coming to pick me in the shape of my childhood friend? </em>I shook that thought off and took the bag from him. </p>\n<p>- “Thank you. Can you keep me company until she comes?” I asked timidly.</p>\n<p>- “Of course. That’s why I am here. Honestly, I am curious how <em>she</em> will take you. Tee-hee.”</p>\n<p class=\"p2\">I don’t remember how long we’d chatted but as I chewed on the last piece of the crispy jackfruit, we heard someone coming.</p>\n<p>- “Is that <em>her</em>?” I could see stars in his eyes and his yellowish teeth sticking out from his mouth.</p>\n<p>“Do you think <em>she </em>is chatty?” I asked but he didn’t answer.</p>\n<p class=\"p2\">As the chatting voice drew closer, I realized there were more than one person. I leaned against the doorframe, wrapped my arms around and held my elbows with the opposite hands. Before I could see the faces I smelled the unmistakable fragrance of a freshly-picked jackfruit. Then, on the cement winding footpath, a shadow emerged. It was my uncle, my Sixth Uncle, his wife, and my mom.</p>\n<p>- “Did you eat yet?” He asked with a familiar unintended coarse voice.</p>\n<p>- “Not yet, Uncle.” I smiled.</p>\n<p>- “Let’s open this jackfruit. It’s from the garden. Your Mom picked it.” </p>\n<p>- “Let’s!” I replied.</p>\n<p class=\"p2\">Then he walked to the corner of the room and switched on the light while my mom lit up the incense sticks and fanned it with her hand to put out the flames. The fragrant smoke engulfed her. There, on the tips of the incense only a dot of burning coal was illuminating. She bowed three times and plugged the sticks down into the censer. She turned around and the room lit up.</p>",
            "image": "https://thanhngoc.me/media/posts/11/20200331_102214.jpg",
            "author": {
                "name": "Thanh Ngoc"
            },
            "tags": [
            ],
            "date_published": "2025-03-18T12:44:00+07:00",
            "date_modified": "2025-03-18T12:44:00+07:00"
        }
    ]
}
